assignment1/benchmarks/aws/disk_benchmark_randwrite_2017-06-15:08:26:12.out
randwrite: (g=0): rw=randwrite, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
...
randwrite: (g=0): rw=randwrite, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
fio-2.1.5
Starting 4 processes
randwrite: Laying out IO file(s) (1 file(s) / 64MB)
randwrite: Laying out IO file(s) (1 file(s) / 64MB)
randwrite: Laying out IO file(s) (1 file(s) / 64MB)
[...]

randwrite: (groupid=0, jobs=4): err= 0: pid=5218: Thu Jun 15 08:27:00 2017
  write: io=262144KB, bw=209548KB/s, iops=52386, runt=  1251msec
    clat (usec): min=5, max=60821, avg=43.53, stdev=1077.49
     lat (usec): min=6, max=60821, avg=50.28, stdev=1167.20
    clat percentiles (usec):
     |  1.00th=[    5],  5.00th=[    5], 10.00th=[    5], 20.00th=[    5],
     | 30.00th=[    5], 40.00th=[    6], 50.00th=[    6], 60.00th=[    6],
     | 70.00th=[    6], 80.00th=[    6], 90.00th=[    6], 95.00th=[    7],
     | 99.00th=[    8], 99.50th=[    9], 99.90th=[13888], 99.95th=[31872],
     | 99.99th=[44800]
    bw (KB  /s): min=41438, max=62357, per=24.98%, avg=52337.50, stdev=7705.08
    lat (usec) : 10=99.52%, 20=0.26%, 50=0.02%, 100=0.01%, 250=0.01%
    lat (usec) : 500=0.01%
    lat (msec) : 10=0.04%, 20=0.07%, 50=0.06%, 100=0.01%
  cpu          : usr=9.01%, sys=16.76%, ctx=209, majf=0, minf=31
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=65536/d=0, short=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: io=262144KB, aggrb=209547KB/s, minb=209547KB/s, maxb=209547KB/s, mint=1251msec, maxt=1251msec

Disk stats (read/write):
  xvda1: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%