assignment1/benchmarks/aws/disk_benchmark_read_2017-06-13:21:10:28.out
read: (g=0): rw=read, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
...
read: (g=0): rw=read, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
fio-2.1.5
Starting 4 processes
read: Laying out IO file(s) (1 file(s) / 64MB)
read: Laying out IO file(s) (1 file(s) / 64MB)
read: Laying out IO file(s) (1 file(s) / 64MB)
[...]

read: (groupid=0, jobs=4): err= 0: pid=5965: Tue Jun 13 21:11:02 2017
  read : io=262144KB, bw=344926KB/s, iops=86231, runt=   760msec
    clat (usec): min=2, max=44709, avg=36.31, stdev=544.99
     lat (usec): min=2, max=44709, avg=38.17, stdev=568.41
    clat percentiles (usec):
     |  1.00th=[    2],  5.00th=[    2], 10.00th=[    2], 20.00th=[    2],
     | 30.00th=[    2], 40.00th=[    2], 50.00th=[    2], 60.00th=[    2],
     | 70.00th=[    3], 80.00th=[    3], 90.00th=[    3], 95.00th=[    3],
     | 99.00th=[  354], 99.50th=[ 2288], 99.90th=[ 6368], 99.95th=[10304],
     | 99.99th=[25984]
    bw (KB  /s): min=79336, max=87481, per=24.33%, avg=83936.75, stdev=3901.42
    lat (usec) : 4=97.13%, 10=0.38%, 20=0.84%, 50=0.52%, 100=0.02%
    lat (usec) : 250=0.05%, 500=0.14%, 750=0.11%, 1000=0.10%
    lat (msec) : 2=0.17%, 4=0.23%, 10=0.24%, 20=0.04%, 50=0.01%
  cpu          : usr=5.81%, sys=12.30%, ctx=792, majf=0, minf=30
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=65536/w=0/d=0, short=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: io=262144KB, aggrb=344926KB/s, minb=344926KB/s, maxb=344926KB/s, mint=760msec, maxt=760msec

Disk stats (read/write):
  xvda1: ios=1993/10, merge=0/6, ticks=6908/0, in_queue=6908, util=78.39%