assignment1/benchmarks/aws/disk_benchmark_read_2017-06-15:08:26:12.out
read: (g=0): rw=read, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
...
read: (g=0): rw=read, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
fio-2.1.5
Starting 4 processes
read: Laying out IO file(s) (1 file(s) / 64MB)
read: Laying out IO file(s) (1 file(s) / 64MB)
read: Laying out IO file(s) (1 file(s) / 64MB)
[...]

read: (groupid=0, jobs=4): err= 0: pid=5190: Thu Jun 15 08:26:46 2017
  read : io=262144KB, bw=354728KB/s, iops=88682, runt=   739msec
    clat (usec): min=2, max=18343, avg=40.33, stdev=481.19
     lat (usec): min=2, max=18344, avg=41.28, stdev=483.20
    clat percentiles (usec):
     |  1.00th=[    2],  5.00th=[    2], 10.00th=[    2], 20.00th=[    2],
     | 30.00th=[    2], 40.00th=[    2], 50.00th=[    2], 60.00th=[    2],
     | 70.00th=[    2], 80.00th=[    3], 90.00th=[    3], 95.00th=[    3],
     | 99.00th=[  668], 99.50th=[ 2928], 99.90th=[ 9920], 99.95th=[11200],
     | 99.99th=[13760]
    bw (KB  /s): min=83944, max=95976, per=25.27%, avg=89631.50, stdev=6148.34
    lat (usec) : 4=97.32%, 10=0.29%, 20=0.76%, 50=0.28%, 100=0.01%
    lat (usec) : 250=0.03%, 500=0.27%, 750=0.07%, 1000=0.10%
    lat (msec) : 2=0.23%, 4=0.38%, 10=0.16%, 20=0.09%
  cpu          : usr=5.15%, sys=11.27%, ctx=936, majf=0, minf=34
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=65536/w=0/d=0, short=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: io=262144KB, aggrb=354728KB/s, minb=354728KB/s, maxb=354728KB/s, mint=739msec, maxt=739msec

Disk stats (read/write):
  xvda1: ios=1603/0, merge=0/0, ticks=7184/0, in_queue=7248, util=82.80%