assignment1/benchmarks/aws/disk_benchmark_readwrite_2017-06-15:08:26:12.out
readwrite: (g=0): rw=rw, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
...
readwrite: (g=0): rw=rw, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
fio-2.1.5
Starting 4 processes
readwrite: Laying out IO file(s) (1 file(s) / 64MB)
readwrite: Laying out IO file(s) (1 file(s) / 64MB)
readwrite: Laying out IO file(s) (1 file(s) / 64MB)
[...]

readwrite: (groupid=0, jobs=4): err= 0: pid=5204: Thu Jun 15 08:26:51 2017
  read : io=130880KB, bw=145261KB/s, iops=36315, runt=   901msec
    clat (usec): min=2, max=14846, avg=72.69, stdev=703.53
     lat (usec): min=2, max=14847, avg=75.21, stdev=715.80
    clat percentiles (usec):
     |  1.00th=[    2],  5.00th=[    2], 10.00th=[    2], 20.00th=[    2],
     | 30.00th=[    2], 40.00th=[    2], 50.00th=[    2], 60.00th=[    2],
     | 70.00th=[    3], 80.00th=[    3], 90.00th=[    3], 95.00th=[    3],
     | 99.00th=[ 2256], 99.50th=[ 3888], 99.90th=[11200], 99.95th=[12096],
     | 99.99th=[13888]
    bw (KB  /s): min=33548, max=39280, per=24.94%, avg=36232.50, stdev=2857.49
  write: io=131264KB, bw=145687KB/s, iops=36421, runt=   901msec
    clat (usec): min=4, max=14431, avg=25.59, stdev=397.54
     lat (usec): min=4, max=14432, avg=26.88, stdev=402.09
    clat percentiles (usec):
     |  1.00th=[    4],  5.00th=[    4], 10.00th=[    4], 20.00th=[    4],
     | 30.00th=[    4], 40.00th=[    4], 50.00th=[    4], 60.00th=[    4],
     | 70.00th=[    4], 80.00th=[    5], 90.00th=[    5], 95.00th=[    6],
     | 99.00th=[   15], 99.50th=[  812], 99.90th=[ 9408], 99.95th=[10560],
     | 99.99th=[13504]
    bw (KB  /s): min=33604, max=39328, per=24.90%, avg=36276.50, stdev=2846.24
    lat (usec) : 4=48.17%, 10=49.20%, 20=0.99%, 50=0.38%, 100=0.01%
    lat (usec) : 250=0.04%, 500=0.09%, 750=0.03%, 1000=0.07%
    lat (msec) : 2=0.31%, 4=0.41%, 10=0.14%, 20=0.16%
  cpu          : usr=5.09%, sys=13.11%, ctx=886, majf=0, minf=38
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=32720/w=32816/d=0, short=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: io=130880KB, aggrb=145260KB/s, minb=145260KB/s, maxb=145260KB/s, mint=901msec, maxt=901msec
  WRITE: io=131264KB, aggrb=145687KB/s, minb=145687KB/s, maxb=145687KB/s, mint=901msec, maxt=901msec

Disk stats (read/write):
  xvda1: ios=1916/0, merge=0/0, ticks=6296/0, in_queue=6296, util=84.96%