assignment1/benchmarks/aws/disk_benchmark_write_2017-06-14:13:32:47.out
write: (g=0): rw=write, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
...
write: (g=0): rw=write, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
fio-2.1.5
Starting 4 processes
write: Laying out IO file(s) (1 file(s) / 64MB)
write: Laying out IO file(s) (1 file(s) / 64MB)
write: Laying out IO file(s) (1 file(s) / 64MB)
[...]

write: (groupid=0, jobs=4): err= 0: pid=5191: Wed Jun 14 13:33:23 2017
  write: io=262144KB, bw=237234KB/s, iops=59308, runt=  1105msec
    clat (usec): min=5, max=60786, avg=45.15, stdev=1141.10
     lat (usec): min=5, max=60787, avg=48.66, stdev=1164.44
    clat percentiles (usec):
     |  1.00th=[    5],  5.00th=[    5], 10.00th=[    5], 20.00th=[    5],
     | 30.00th=[    5], 40.00th=[    5], 50.00th=[    6], 60.00th=[    6],
     | 70.00th=[    6], 80.00th=[    6], 90.00th=[    6], 95.00th=[    7],
     | 99.00th=[    8], 99.50th=[    9], 99.90th=[15936], 99.95th=[38656],
     | 99.99th=[44800]
    bw (KB  /s): min=48546, max=78528, per=25.11%, avg=59569.29, stdev=10125.03
    lat (usec) : 10=99.55%, 20=0.22%, 50=0.02%, 100=0.03%, 250=0.01%
    lat (usec) : 1000=0.01%
    lat (msec) : 4=0.01%, 10=0.04%, 20=0.06%, 50=0.07%, 100=0.01%
  cpu          : usr=6.95%, sys=19.57%, ctx=179, majf=0, minf=35
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=65536/d=0, short=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: io=262144KB, aggrb=237234KB/s, minb=237234KB/s, maxb=237234KB/s, mint=1105msec, maxt=1105msec

Disk stats (read/write):
  xvda1: ios=0/3, merge=0/22, ticks=0/0, in_queue=0, util=0.00%