assignment1/benchmarks/aws/disk_benchmark_write_2017-06-15:08:26:12.out
write: (g=0): rw=write, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
...
write: (g=0): rw=write, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
fio-2.1.5
Starting 4 processes
write: Laying out IO file(s) (1 file(s) / 64MB)
write: Laying out IO file(s) (1 file(s) / 64MB)
write: Laying out IO file(s) (1 file(s) / 64MB)
[...]

write: (groupid=0, jobs=4): err= 0: pid=5197: Thu Jun 15 08:26:48 2017
  write: io=262144KB, bw=238313KB/s, iops=59578, runt=  1100msec
    clat (usec): min=5, max=65304, avg=44.78, stdev=1159.18
     lat (usec): min=5, max=65305, avg=50.28, stdev=1227.02
    clat percentiles (usec):
     |  1.00th=[    5],  5.00th=[    5], 10.00th=[    5], 20.00th=[    5],
     | 30.00th=[    5], 40.00th=[    5], 50.00th=[    6], 60.00th=[    6],
     | 70.00th=[    6], 80.00th=[    6], 90.00th=[    6], 95.00th=[    7],
     | 99.00th=[    8], 99.50th=[    9], 99.90th=[14272], 99.95th=[32384],
     | 99.99th=[51968]
    bw (KB  /s): min=44164, max=76384, per=24.80%, avg=59099.50, stdev=10639.48
    lat (usec) : 10=99.59%, 20=0.19%, 50=0.02%, 100=0.01%, 250=0.01%
    lat (msec) : 2=0.01%, 4=0.01%, 10=0.05%, 20=0.06%, 50=0.06%
    lat (msec) : 100=0.01%
  cpu          : usr=6.96%, sys=18.28%, ctx=182, majf=0, minf=35
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=65536/d=0, short=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: io=262144KB, aggrb=238312KB/s, minb=238312KB/s, maxb=238312KB/s, mint=1100msec, maxt=1100msec

Disk stats (read/write):
  xvda1: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%